const CarouselData = [
  {
    id: 1,
    img: "../../img/товаровед.png",
    title1: "товаровед",
    text: "Контроль поступления товаров и наличие товаров на складе",
  },
  {
    id: 2,
    img: "../../img/водитель.png",
    title1: "водитель",
    text: "Доставка товара по магазинам и гипермаркетам компании в обслуживаемом регионе",
  },
  {
    id: 3,
    img: "../../img/повар.png",
    title1: "пекарь",
    text: "Создание вкусной и ароматной выпечки",
  },
  {
    id: 4,
    img: "../../img/кассир.png",
    title1: "кассир",
    text: "Проведение денежных операций и выдача чеков каждому покупателю",
  },
  {
    id: 5,
    img: "../../img/продавец.png",
    title1: "продавец",
    text: "Оперативное и вежливое обслуживание покупателей: предложение и показ товаров",
  },
  {
    id: 6,
    img: "../../img/повар2.png",
    title1: "повар",
    text: "Приготовление различных блюд, их оформление, разработка новых собственных рецептов",
  },
  {
    id: 7,
    img: "../../img/приёмщик.png",
    title1: "приёмщик",
    text: "Осуществляет количественное принятие поступающих товаров",
  },
];

export default CarouselData;
